INSERT INTO train (type,number,runtime,seat_size,coach_size)
VALUES
('复兴号',15,5,80,16),
('和谐号',20,10,100,20),
('绿皮火车',50,12,80,20);

INSERT INTO route (name,start_station,end_station)
VALUES
("京沪线","北京南","上海虹桥"),
("京广线","北京西","广州南");


INSERT INTO station (route_id,name,arrive_day,arrive_hour,arrive_minute,break_time)
VALUES
(1,"北京南",0,6,20,0),
(1,"沧州西",0,7,13,2),
(1,"济南西",0,8,1,3),
(1,"宿州东",0,9,28,5),
(1,"蚌埠南",0,9,56,2),
(1,"南京南",0,10,40,3),
(1,"无锡东",0,11,27,2),
(1,"上海虹桥",0,11,58,0),
(2,"北京西",0,7,26,0),
(2,"保定东",0,8,14,2),
(2,"定州东",0,8,34,16),
(2,"石家庄",0,9,12,3),
(2,"邯郸东",0,9,54,2),
(2,"郑州东",0,11,3,4),
(2,"武汉",0,13,12,4),
(2,"长沙南",0,14,38,7),
(2,"广州南",0,17,19,5);
